system/blockMeshDict_antiguo
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mergeType points;   // Wedge geometry - Merge points instead of topology

scale   1e-3;

vertices
(
    (0 0 0)  //tobera
    (300 0 0)
    (0 0.495 -0.0216121677297) //tobera
    (300 1.485 -0.0648365031892)
    (0 1.98 -0.0864486354189)
    (300 3.465 -0.151283905919)
    (0 3.96 -0.172896038148)
    (300 4.95 -0.216121677297)
    (0 7.92 -0.345794708273)
    (300 7.92 -0.345794708273)

    (0 0.495 0.0216121677297)  //tobera
    (300 1.485 0.0648365031892)
    (0 1.98 0.0864486354189)   
    (300 3.465 0.151283905919)
    (0 3.96 0.172896038148)
    (300 4.95 0.216121677297)
    (0 7.92 0.345794708273)
    (300 7.92 0.345794708273)
);

blocks
(
    hex (0 1 3 2 0 1 11 10)
    (75 30 1)
    edgeGrading (1 1 1 1 0.1666667 1 1 0.1666667 1 1 1 1)

    hex (2 3 5 4 10 11 13 12)
    (75 40 1)
    edgeGrading (1 1 1 1 20 1 1 20 1 1 1 1)

    hex (4 5 7 6 12 13 15 14)
    (75 15 1)
    simpleGrading (1.0 1.0 1.0)

    hex (6 7 9 8 14 15 17 16)
    (75 15 1)
    simpleGrading (1.0 1.0 1.0)
);

edges
(
);

boundary
(
    axis
    {
        type empty;
        faces
        (
            (0 1 1 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 0 10 2)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (2 10 12 4)
            (4 12 14 6)
            (6 14 16 8)
			(7 9 17 15)
			(5 7 15 13)
			(3 5 13 11)
            (1 3 11 1)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8 16 17 9)
        );
    }

    front
    {
        type wedge;
        faces
        (
            (0 1 11 10)
            (10 11 13 12)
            (12 13 15 14)
            (14 15 17 16)
        );
    }

    back
    {
        type wedge;
        faces
        (
            (0 2 3 1)
            (2 4 5 3)
            (4 6 7 5)
            (6 8 9 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
